Дневник_Инвестора/src/Catalogs/Облигации/Облигации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Облигации</name>
  <attributes>
    <name>Тикер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ISIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Эмитенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дневник_Инвестора/src/Catalogs/Облигации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс  

Процедура СоздатьНовыйЭлемент(Параметры) Экспорт
	
	Элемент = СоздатьЭлемент();
	Элемент.Заполнить(Параметры);
	
	Если Элемент.ПроверитьЗаполнение() Тогда
		Элемент.Записать();
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось записать новый облигационный актив, проверка заполнения не пройдена.'");	
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйПараметрыОблигации() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("Тикер", "");
	Параметры.Вставить("ISIN", "");
	Параметры.Вставить("Номинал", 0);
	Параметры.Вставить("Эмитент", Справочники.Эмитенты.ПустаяСсылка());
	Параметры.Вставить("Валюта", Справочники.Валюты.ПустаяСсылка());
	Параметры.Вставить("ДатаПогашения", Дата(1, 1, 1));
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
